[
    {
        "id": 1,
        "english": "All of the students are looking forward to the four-day graduation trip to Kenting.",
        "chinese": "所有的同學都非常期待去墾丁四天的畢業旅行"
    },
    {
        "id": 2,
        "english": "Whether it is a visit to Sun-Moon Lake or a tour in Kaohsiung, I will not miss out on the graduation trip.",
        "chinese": "無論是去日月潭旅遊或是去高雄觀光，我絕不會錯過畢業旅行"
    },
    {
        "id": 3,
        "english": "Dressing up for the prom is one of the most unforgettable memories in high school for me.",
        "chinese": "盛裝參加畢業舞會是我高中最難忘的回憶之一。"
    },
    {
        "id": 4,
        "english": "In the graduation ceremony, the principal said a lot of inspiring words to encourage the graduates to pursue their dreams.",
        "chinese": "畢業典禮上校長說了很多激勵人心的話，去鼓勵畢業生追求夢想。"
    },
    {
        "id": 5,
        "english": "He said graduation is an important milestone in life other than getting a diploma.",
        "chinese": "他說畢業除了拿到文憑之外，也是人生重要的里程碑。"
    },
    {
        "id": 6,
        "english": "To apply for the scholarship, you have to prepare a study plan and two recommendation letters.",
        "chinese": "申請這獎學金，你必須準備好讀書計畫和兩封推薦信。"
    },
    {
        "id": 7,
        "english": "Only when you are fully prepared are you able to leave a deep impression on the professors.",
        "chinese": "只有當你充分準備，才能夠讓大學教授留下深刻的印象。"
    },
    {
        "id": 8,
        "english": "What professors want to see from your academic portfolio is how much you explore your own interests, not how many extracurricular activities you have participated in.",
        "chinese": "教授想從你的學習歷程檔案中看到的是你探索自己興趣的多少，而不是你參加了多少課外活動。。"
    },
    {
        "id": 9,
        "english": "College application is indeed a difficult process. Had it not been for my teacher’s advice, I might not have been able to rise to the challenge.",
        "chinese": "申請大學過程的確很辛苦。要不是老師的建議，我可能無法成功面對挑戰。"
    },
    {
        "id": 10,
        "english": "Only by working hard and never giving up can you get admitted to your ideal college.",
        "chinese": "只有藉由努力和永不放棄，才能進入你理想中的大學。"
    },
    {
        "id": 11,
        "english": "People generally consider it unhealthy to have night snacks before bedtime.",
        "chinese": "一般認為睡前吃宵夜是不健康的。"
    },
    {
        "id": 12,
        "english": "When people are stressed, they eat comfort food, such as fried chicken or apple pies, to cope with negative feelings and improve their mood.",
        "chinese": "人們壓力大時會吃像是炸雞和蘋果派等的安慰食品，來處理負面情緒和改善心情。"
    },
    {
        "id": 13,
        "english": "On special occasions, our family will dine out to celebrate.",
        "chinese": "在特殊的場合，我們一家人會外出用餐來慶祝。"
    },
    {
        "id": 14,
        "english": "It is about time that I kicked my bad habit of oversleeping.",
        "chinese": "該是我戒掉睡過頭的壞習慣的時候了。"
    },
    {
        "id": 15,
        "english": "John tended to oversleep in the morning and ended up having no time to freshen up and eat breakfast.",
        "chinese": "John早上往往睡過頭，而結果沒有時間梳洗和吃早餐。"
    },
    {
        "id": 16,
        "english": "He didn’t develop the good habit of keeping early hours until he started working.",
        "chinese": "直到他開始工作，他才養成早睡早起的好習慣。"
    }
]