[
    {
        "id": 1,
        "english": "Playing online games is not a waste of time. In fact, some challenging games can improve your problem-solving skills.",
        "chinese": "玩線上遊戲並不浪費時間。 事實上，有些具有挑戰性的遊戲可以增進你解決問題的技能。"
    },
    {
        "id": 2,
        "english": "High school students should be equipped with the ability to think independently and analyze data.",
        "chinese": "高中生應該具備有獨立思考和分析資料的能力"
    },
    {
        "id": 3,
        "english": "Though some scenes are very bloody, I feel relieved when a murder case is solved.",
        "chinese": "雖然有些場景很血腥，但是謀殺案被偵破時，我感到鬆了一口氣。"
    },
    {
        "id": 4,
        "english": "Of all the TV channels, I like to watch National Geographic Channel the most.",
        "chinese": "在所有個電視頻道中，我最喜歡收看國家地理頻道。"
    },
    {
        "id": 5,
        "english": "Playing table tennis not only improves hand-eye coordination but also keeps your brain sharp.",
        "chinese": "打桌球不僅增進手眼協調，還能讓你保持腦袋靈敏。"
    },
    {
        "id": 6,
        "english": "Their educational and informative programs attract people of all ages.",
        "chinese": "它們充滿教育性質與充滿知識性的節目吸引各年齡層的人。"
    },
    {
        "id": 7,
        "english": "One of the reasons why I like this romantic movie is that it is based on a real-life story.",
        "chinese": "我最喜歡這部浪漫愛情片的原因之一是它以真實故事為根據。"
    },
    {
        "id": 8,
        "english": "The exercise not only eases my back pain but also gives me peace of mind.",
        "chinese": "這運動不僅緩和我的背痛還讓我心情平靜。"
    },
    {
        "id": 9,
        "english": "I go to gym three times a week so that I can stay both my physically and mentally healthy.",
        "chinese": "我每周上健身房三次，如此一來我能保持身心健康。"
    },
    {
        "id": 10,
        "english": "Now he gradually finds that biking enable him to reduce anxious and fell energetic.",
        "chinese": "現在他逐漸發現騎腳踏車讓他減輕焦慮並且充滿活力。"
    },
    {
        "id": 11,
        "english": "I've signed up for group fitness classes so that I can movitage myself to exercise on a regular basis.",
        "chinese": "我報名參加了團體課程，這樣我才能激勵自己規律運動。"
    },
    {
        "id": 12,
        "english": "Jogging regularly boost your blood circulation, thus decline your case of heart disease and strokes.",
        "chinese": "規律的慢跑增強血液循環，因此降低你心臟病和中風的風險。"
    },
    {
        "id": 13,
        "english": "Though I can't play any musical instrument, I still enjoy appreciate all kinds of music and dance to the music once in a while.",
        "chinese": "雖然我不會彈奏任何樂器，但是我仍舊欣賞各種音樂，並偶爾隨著音樂起舞。"
    },
    {
        "id": 14,
        "english": "Speaking of my favorite singer, the name \"Rick Astley\" immediately comes into my mind.",
        "chinese": "說到我最喜愛的歌手，Rick Astley 這個名字立刻出現在我的腦海。"
    },
    {
        "id": 15,
        "english": "Sean was so absored in music that he forgot to eat lunch.",
        "chinese": "Sean 太全神貫注於音樂了，以至於忘了吃午餐。"
    },
    {
        "id": 16,
        "english": "After school, Yvonne likes to turn on the radio and immerse herself in soft music.",
        "chinese": "放學後，Yvonne 喜歡打開收音機，然後沉靜於音樂之中。"
    },
    {
        "id": 17,
        "english": "The reason for the popularity at her song is that tunes are catchy.",
        "chinese": "他的歌曲這麼受歡迎的原因是因為旋律易聽好記。"
    },
    {
        "id": 18,
        "english": "Through reading, you can travel to any time period in history or any place in the world; that's why reading is my favorite pastime.",
        "chinese": "透過閱讀，你可以遊覽到史上任何時期或世上任何地方；這就是為什麼閱讀是我最喜歡的休閒娛樂。"
    },
    {
        "id": 19,
        "english": "The athlete's biography was so encouraging that it became a best-seller overnight.",
        "chinese": "這運動員的傳記是如此鼓勵人心，一夜之間成了暢銷書。"
    },
    {
        "id": 20,
        "english": "The more widely you read, the more knowledge you gain and the stronger thinking skills you develop.",
        "chinese": "你閱讀的範圍越廣，你學到的知識越多，同時你培養的思維能力越強。"
    },
    {
        "id": 21,
        "english": "Research shows that people who read a lot have a greater ability to relate to other people's fellings and beliefs.",
        "chinese": "研究顯示，大量閱讀的人更能夠理解他人的感受與想法。"
    },
    {
        "id": 22,
        "english": "Reading expands your horizons because there are various subject you can choose from.",
        "chinese": "閱讀擴展你的視野，因為有各種可以選擇的主題。"
    }
]